core/plugins/MenuBuilder/MenuBuilderFrontendRender.php

select * from `menus` where `menus`.`id` = 1 limit 1
---
    public function render_frrontend_panel_menu($id){
        $output = '';
        if (empty($id)){
            return $output;
        }
        $menu_details_from_db = Menu::find($id);