core/Modules/MobileApp/Http/Controllers/Api/V1/UserController.php

select `id`, `password`, `username`, `email_verified` from `users` where `username` = 'suzon' limit 1
---
    public function login(Request $request)
    {
        $validate = UserServices::validateLoginRequest($request->all());

        if ($validate->fails()){
            return UserServices::validationErrorsResponse($validate);
        }

        $validated = $validate->validated();

        // Set login type
        $user_login_type = UserServices::loginUserType($validated["username"]);

        if($user_login_type == 'email' && !UserServices::isValideEmail($validated["username"])){
            return UserServices::emailValidationResponse();
        }

        $user = User::select('id', 'password', $user_login_type,'email_verified')->where($user_login_type, $validated["username"])->first();

select * from `user_delivery_addresses` where `user_id` = 1
---
    public function get_all_shipping_address(){
        $user_id = auth('sanctum')->user()->id;

        return response()->json(["data" => UserDeliveryAddress::with(["state","country:id,name","state:id,name"])->where('user_id', $user_id)->get()]);

select * from `user_delivery_addresses` where `user_delivery_addresses`.`user_id` in (1)
select * from `users` where `id` = 1 limit 1
---
    public function profile(){

        $user_id = auth('sanctum')->id();
        $user = User::with('userCountry','userState','delivery_address')
            ->where('id',$user_id)->first();