core/app/Http/Controllers/Landlord/Admin/CustomDomainController.php

select * from `custom_domains`
---
    public function all_domain_requests()
    {
        $domain_infos = CustomDomain::all();