core/app/Http/Controllers/Landlord/Admin/GeneralSettingsController.php

select * from `payment_gateways`
---
    public function payment_settings()
    {
        $all_gateway = PaymentGateway::all();