core/app/Http/Controllers/Landlord/Admin/LanguagesController.php

select * from `languages`
---
    public function index()
    {
        $all_lang = Language::all();