core/app/Http/Controllers/Landlord/Admin/PricePlanController.php

select * from `price_plans` order by `id` desc
---
    public function all_price_plan(){
        $all_plans = PricePlan::orderBy('id','desc')->get();