core/app/Http/Controllers/Landlord/Admin/TenantManageController.php

select * from `users` order by `created_at` desc
---
    public function all_tenants(){
        $all_users = User::latest()->get();

select * from `users` where `users`.`id` in (10)
---
    public function tenant_activity_log()
    {
        $activities = Activity::with(['subject','causer'])->latest()->paginate(8);

select * from `payment_logs` where `payment_logs`.`id` in (136)
---
    public function tenant_details($id)
    {
        $user = User::with('tenant_details','tenant_details.payment_log')->findOrFail($id);