core/app/Http/Controllers/Landlord/Admin/ThemeManageController.php

select * from `themes` order by `id` asc
---
    public function all_theme()
    {
        $all_themes = Themes::orderBy('id', 'asc')->get();