core/plugins/WidgetBuilder/Widgets/Tenants/ThemeOne/FooterBottomLinksWidget.php

    public function frontend_render()
    {
        // TODO: Implement frontend_render() method.
        $widget_saved_values = $this->get_settings();
        $widget_navbar = SanitizeInput::esc_url($widget_saved_values['navbar_link']) ?? '';

        $instance = Menu::findOrFail($widget_navbar);

        $li_markup = '';
        foreach (json_decode($instance->content) ?? [] as $item) {
            if (empty(Page::find($item->pid)))
---
select * from `menus` where `menus`.`id` = '1' limit 1
select * from `pages` where `pages`.`id` = 1 limit 1