core/app/Http/Services/CheckoutToPaymentService.php

select * from `product_orders` where `product_orders`.`id` = 167 limit 1
select * from `order_products` where `order_id` = 167
---
    public static function checkoutToGateway($data) // getting all parameter in one array
    {
        $payment_details = ProductOrder::find($data['order_log_id']);
        $payment_gateway = $payment_details->payment_gateway;
        $checkout_type = $payment_details->checkout_type;
        $amount_to_charge = $payment_details->total_amount;

        $ordered_products = OrderProducts::where('order_id', $payment_details->id)->get();

select * from `product_inventories` where `product_id` = 236 limit 1
update `product_inventories` set `stock_count` = `stock_count` - 1 where `id` = 257
update `product_inventories` set `sold_count` = 33 where `id` = 257
---
                    }
                }
            }
            $product_inventory = ProductInventory::where('product_id', $product->product_id)->first();
            $product_inventory->decrement('stock_count', $product->quantity);
            $product_inventory->sold_count = $product_inventory->sold_count == null ? 1 : $product_inventory->sold_count + $product->quantity;
            $product_inventory->save();

select `id`, `product_id` from `product_inventory_details` where `stock_count` <= '5' and exists (select * from `products` where `product_inventory_details`.`product_id` = `products`.`id` and `is_inventory_warn_able` = 1 and `products`.`deleted_at` is null)
select `id` from `products` where `is_inventory_warn_able` = 1 and exists (select * from `product_inventories` where `products`.`id` = `product_inventories`.`product_id` and `stock_count` <= '5') and `products`.`deleted_at` is null
select `id`, `name`, `is_inventory_warn_able` from `products` where `id` in (195, 239) and `products`.`deleted_at` is null
---
    private static function checkStock()
    {
        // Inventory Warnings
        $threshold_amount = get_static_option('stock_threshold_amount');

        $inventory_product_items = \Modules\Product\Entities\ProductInventoryDetail::where('stock_count', '<=', $threshold_amount)
            ->whereHas('is_inventory_warn_able', function ($query) {
                $query->where('is_inventory_warn_able', 1);
            })
            ->select('id', 'product_id')
            ->get();

        $inventory_product_items_id = !empty($inventory_product_items) ? $inventory_product_items->pluck('product_id')->toArray() : [];

        $products = \Modules\Product\Entities\Product::with('inventory')
            ->where('is_inventory_warn_able', 1)
            ->whereHas('inventory', function ($query) use ($threshold_amount) {
                $query->where('stock_count', '<=', $threshold_amount);
            })
            ->select('id')
            ->get();

        $products_id = !empty($products) ? $products->pluck('id')->toArray() : [];

        $every_filtered_product_id = array_unique(array_merge($inventory_product_items_id, $products_id));
        $all_products = \Modules\Product\Entities\Product::whereIn('id', $every_filtered_product_id)->select('id', 'name', 'is_inventory_warn_able')->get();