core/app/Http/Services/ProductCheckoutService.php

    public function getOrCreateUser($validated_data): array
    {
        $user = Auth::guard('web')->user();
        if ($user == null || ($user != null && $user->delivery_address == null)) { // get non-logged in user or user with no billing address
            $name = $validated_data['name'];
            $email = trim(strtolower($validated_data['email']));
            $phone = $validated_data['phone'];

            $country_id = $validated_data['country'];
            $country_name = Country::find($country_id)->first()->name;

            $state_id = $validated_data['state'];
            $state_name = State::find($state_id)->first()->name;
---
select * from `countries` where `countries`.`id` = '2' limit 1
select * from `states` where `states`.`id` = '6' limit 1

                $price = $this->coupon_based_products($coupon_type_info, $ids, $totalPriceDetails['quantity'][$key]);
            }

            OrderProducts::create([
                'order_id' => $order_id,
                'product_id' => $totalPriceDetails['products_id'][$key],
                'variant_id' => !empty($totalPriceDetails['variants_id'][$key]) ? $totalPriceDetails['variants_id'][$key] : null,
                'quantity' => $totalPriceDetails['quantity'][$key] ?? null,
                'price' => $price ?? $totalPriceDetails['price'][$key]
            ]);
---
insert into `order_products` (`order_id`, `product_id`, `variant_id`, `quantity`, `price`, `updated_at`, `created_at`) values (167, 236, '', '1', 750, '2023-02-14 11:41:18', '2023-02-14 11:41:18')

    private function get_product_shipping_tax($request)
    {
        $shipping_cost = 0;
        $product_tax = 0;

        if ($request['state'] && $request['country']) {
            $product_tax = StateTax::where(['country_id' => $request['country'], 'state_id' => $request['state']])->select('id', 'tax_percentage')->first();

            if (empty($product_tax))
            {
                $product_tax = CountryTax::where('country_id', $request['country'])->select('id', 'tax_percentage')->first();
            }

            if ($product_tax) {
                $product_tax = $product_tax->toArray()['tax_percentage'];
            }
        } else {
            $product_tax = CountryTax::where('country_id', $request['country'])->select('id', 'tax_percentage')->first();
            if ($product_tax) {
                $product_tax = $product_tax->toArray()['tax_percentage'];
            }
        }

        $shipping = ShippingMethod::find($request['shipping_method']);
---
select `id`, `tax_percentage` from `state_taxes` where (`country_id` = '2' and `state_id` = '6') limit 1
select `id`, `tax_percentage` from `country_taxes` where `country_id` = '2' limit 1
select * from `shipping_methods` where `shipping_methods`.`id` = 1 limit 1

    private function check_shipping_method($user, $data) // Checking shipping method is selected
    {
        $shipping = ZoneRegion::whereJsonContains('state', (string)$user['state'])->first();
        if (empty($shipping)) {
            $shipping = ZoneRegion::whereJsonContains('country', (string)$user['country'])->first();
---
select * from `zone_regions` where json_contains(`state`, '\"6\"') limit 1
select * from `zone_regions` where json_contains(`country`, '\"2\"') limit 1