core/app/Http/Controllers/Landlord/Frontend/LandlordFrontendController.php

    public function homepage()
    {
        $id = get_static_option('home_page');
        $page_post = Page::where('id', $id)->first();
---
select * from `pages` where `id` = '1' limit 1

    public function dynamic_single_page($slug)
    {
        $page_post = Page::where('slug', $slug)->firstOrFail();
---
select * from `pages` where `slug` = 'home' limit 1

    public function plan_order($id)
    {
        abort_if(empty($id), 404);

        $order_details = PricePlan::findOrFail($id);
        $payment_gateways = PaymentGateway::where('name', 'manual_payment')->first();
---
select * from `price_plans` where `price_plans`.`id` = '7' limit 1
select * from `payment_gateways` where `name` = 'manual_payment' limit 1