core/app/Actions/Payment/Tenant/PaymentGatewayIpn.php

select * from `product_orders` where `id` = 166 limit 1
---
    public function send_order_mail($order_id)
    {
        $order_details = ProductOrder::where('id', $order_id)->firstOrFail();