core/app/Http/Controllers/Tenant/Frontend/CheckoutPaymentController.php

select * from `countries` where `status` = 'publish'
select * from `states` where `status` = 'publish'
---
    public function checkout_page()
    {
        $cart_data = Cart::content();
        $billing_info = Auth::guard('web')->user()?->delivery_address;
        $countries = Country::where('status', 'publish')->get();
        $states = State::where('status', 'publish')->get();