core/app/Http/Controllers/Tenant/Frontend/TenantFrontendController.php

select * from `pages` where `id` = '1' limit 1
---
    public function homepage()
    {
        $id = get_static_option('home_page');
        $page_post = Page::where('id', $id)->first();

select * from `pages` where `slug` = 'home' limit 1
select count(*) as aggregate from `products` where `status_id` = 1 and `products`.`deleted_at` is null
select `id`, `name`, `size_code`, `slug` from `sizes` where exists (select * from `product_inventory_details` where `sizes`.`id` = `product_inventory_details`.`size`)
select `id`, `name`, `color_code`, `slug` from `colors`
select distinct `tag_name` from `product_tags`
---
    public function dynamic_single_page($slug)
    {
        $page_post = Page::where('slug', $slug)->first();

        abort_if(empty($page_post), 404);

        $blog_page_slug = get_page_slug(get_static_option('blog_page'), 'blog_page');
        if ($slug === $blog_page_slug) {
            if (tenant()) {
                $sorting = blog_sorting(request());
                $order_by = $sorting['order_by'];
                $order = $sorting['order'];
                $order_type = $sorting['order_type'];

                $blogs = Blog::where('status', 1)->orderBy($order_by, $order)->paginate(get_static_option('blog_page_item_show') ?? 9);

                return view('blog::tenant.frontend.blog.blog-all')->with([
                    'page_post' => $page_post,
                    'blogs' => $blogs,
                    'order_type' => $order_type
                ]);
            }
        }

        $shop_page_slug = get_page_slug(get_static_option('shop_page'), 'shop_page');
        if ($slug === $shop_page_slug) {
            if (tenant()) {
                $product_object = Product::where('status_id', 1)->latest()->paginate(12);
                $categories = Category::whereHas('product_categories')->select('id', 'name', 'slug')->withCount('product_categories')->get();
                $sizes = Size::whereHas('product_sizes')->select('id', 'name', 'size_code', 'slug')->get();
                $colors = Color::select('id', 'name', 'color_code', 'slug')->get();
                $tags = ProductTag::select('tag_name')->distinct()->get();

select `product_categories`.`product_id` from `product_categories` where `product_id` != 223 and `category_id` = 10
select * from `product_categories`
select * from `product_uom`
select max(`price`) as aggregate from `products` where `products`.`deleted_at` is null
select min(`price`) as aggregate from `products` where `products`.`deleted_at` is null
select * from `product_tags`
---
    public function product_details($slug)
    {
        extract($this->productVariant($slug));


        $sub_category_arr = json_decode($product->sub_category_id, true);

        // related products
        $product_category = $product?->category?->id;
        $product_id = $product->id;
        $related_products = Product::where('status_id', 1)
            ->whereIn('id', function ($query) use ($product_id, $product_category) {
                $query->select('product_categories.product_id')
                    ->from(with(new ProductCategory())->getTable())
                    ->where('product_id', '!=', $product_id)
                    ->where('category_id', '=', $product_category)
                    ->get();
            })
            ->inRandomOrder()
            ->take(5)
            ->get();


        // sidebar data
        $all_category = ProductCategory::all();
        $all_units = ProductUom::all();
        $maximum_available_price = Product::query()->with('category')->max('price');
        $min_price = request()->pr_min ? request()->pr_min : Product::query()->min('price');
        $max_price = request()->pr_max ? request()->pr_max : $maximum_available_price;
        $all_tags = ProductTag::all();

select * from `product_inventories` where `product_id` = '205' limit 1
---
    public function add_to_cart(Request $request): JsonResponse
    {
        $request->validate([
            'product_id' => 'required',
            'quantity' => 'required',
            'pid_id' => 'nullable',
            'product_variant' => 'nullable',
            'selected_size' => 'nullable',
            'selected_color' => 'nullable'
        ]);

        $product_inventory = ProductInventory::where('product_id', $request->product_id)->first();

select * from `product_inventories` where `product_id` = '192' limit 1
select * from `product_inventory_details` where `id` is null limit 1
select * from `campaign_sold_products` where `product_id` = '192' limit 1
---
    public function cart_update_ajax(Request $request)
    {
        $request->validate([
            'product_id' => 'required',
            'quantity' => 'required',
            'variant_id' => 'nullable'
        ]);

        $product_data = Cart::get($request->product_id);
        $product_inventory = ProductInventory::where('product_id', $product_data->id)->first();
        $product_inventory_details = ProductInventoryDetail::where('id', $request->variant_id)->first();

        if ($product_inventory_details && $request->quantity > $product_inventory_details->stock_count) {
            return response()->json([
                'type' => 'warning',
                'quantity_msg' => __('Requested quantity is not available. Only available quantity is added to cart')
            ]);
        } elseif ($product_inventory && $request->quantity > $product_inventory->stock_count) {
            return response()->json([
                'type' => 'warning',
                'quantity_msg' => __('Requested quantity is not available. Only available quantity is added to cart')
            ]);
        }

        $sold_count = CampaignSoldProduct::where('product_id', $product_data->id)->first();

select * from `product_inventories` where `product_id` = '227' limit 1
select * from `campaign_sold_products` where `product_id` = '227' limit 1
---
    public function buy_now(Request $request)
    {
        $request->validate([
            'pid_id' => 'nullable',
            'product_id' => 'required',
            'quantity' => 'required',
            'product_variant' => 'nullable',
            'selected_size' => 'nullable',
            'selected_color' => 'nullable'
        ]);

        $product_inventory = ProductInventory::where('product_id', $request->product_id)->first();
        if ($request->product_variant) {
            $product_inventory_details = ProductInventoryDetail::where('id', $request->product_variant)->first();
        } else {
            $product_inventory_details = null;
        }

        if ($product_inventory_details && $request->quantity > $product_inventory_details->stock_count) {
            return response()->json([
                'type' => 'warning',
                'quantity_msg' => __('Requested quantity is not available. Only available quantity is added to cart')
            ]);
        } elseif ($product_inventory && $request->quantity > $product_inventory->stock_count) {
            return response()->json([
                'type' => 'warning',
                'quantity_msg' => __('Requested quantity is not available. Only available quantity is added to cart')
            ]);
        }

        $sold_count = CampaignSoldProduct::where('product_id', $request->product_id)->first();

select * from `zone_regions` where json_contains(`country`, '\"1\"')
select * from `shipping_methods` where `zone_id` in (1) or `is_default` = 1
select * from `shipping_methods` where 0 = 1 or `is_default` = 1
---
    public function sync_product_total(Request $request)
    {
        $request->validate([
            'country' => 'required',
            'state' => 'nullable'
        ]);

        $country = $request->country;
        $state = $request->state;

        $product_tax = $this->get_product_shipping_tax($request);

        $shipping_zones = ZoneRegion::whereJsonContains('country', $request->country)->get();

        $zone_ids = [];
        foreach ($shipping_zones ?? [] as $zone) {
            $zone_ids[] = $zone->zone_id;
        }

        $shipping_methods = ShippingMethod::whereIn('zone_id', $zone_ids)
            ->orWhere('is_default', 1)->get();
        $default_shipping = $shipping_methods->where('is_default', 1)->first();

select * from `shipping_methods` where `shipping_methods`.`id` = '1' limit 1
select `tax_percentage` from `country_taxes` where `country_id` = '2' limit 1
select `tax_percentage` from `state_taxes` where (`country_id` = '2' and `state_id` = '6') limit 1
---
    public function sync_product_total_wth_shipping_method(Request $request)
    {
        $request->validate([
            'country' => 'required',
            'state' => 'nullable',
            'shipping_method' => 'required',
            'total' => 'required'
        ]);

        $selected_shipping_method = ShippingMethod::with('options')->find($request->shipping_method);
        $shipping_charge = $selected_shipping_method?->options?->cost;

        if ($request->total < $selected_shipping_method?->options?->minimum_order_amount) {
            return response()->json([
                'type' => 'error',
                'msg' => __(sprintf('%s%s Minimum order amount needed.' ,site_currency_symbol(), $selected_shipping_method?->options?->minimum_order_amount))
            ]);
        }

        if ($selected_shipping_method?->options?->tax_status == 1) {
            $country_tax = CountryTax::where('country_id', $request->country)->select('tax_percentage')->first();
            if ($request->state !== null) {
                $state_tax = StateTax::where(['country_id' => $request->country, 'state_id' => $request->state])->select('tax_percentage')->first();

select `id`, `tax_percentage` from `country_taxes` where `country_id` = '1' limit 1
select `id`, `tax_percentage` from `state_taxes` where (`country_id` = '1' and `state_id` = '2') limit 1
---
    private function get_product_shipping_tax($request)
    {
        $product_tax = 0;
        $country_tax = CountryTax::where('country_id', $request->country)->select('id', 'tax_percentage')->first();

        if ($request->state && $request->country) {
            $product_tax = StateTax::where(['country_id' => $request->country, 'state_id' => $request->state])
                ->select('id', 'tax_percentage')->first();

select * from `product_inventory_details` where `product_inventory_details`.`product_id` in (223)
select `categories`.*, `product_categories`.`product_id` as `laravel_through_key` from `categories` inner join `product_categories` on `product_categories`.`category_id` = `categories`.`id` where `product_categories`.`product_id` in (223) and `categories`.`deleted_at` is null
select `colors`.*, `product_inventory_details`.`product_id` as `laravel_through_key` from `colors` inner join `product_inventory_details` on `product_inventory_details`.`color` = `colors`.`id` where `product_inventory_details`.`product_id` in (223)
select `sizes`.*, `product_inventory_details`.`product_id` as `laravel_through_key` from `sizes` inner join `product_inventory_details` on `product_inventory_details`.`size` = `sizes`.`id` where `product_inventory_details`.`product_id` in (223)
---
    public static function productVariant($slug)
    {
        $product = Product::where('slug', $slug)
            ->with(
                'category',
                'tag',
                'color',
                'sizes',
                'inventoryDetail',
                'inventoryDetail.productColor',
                'inventoryDetail.productSize',
                'inventoryDetail.attribute',
                'reviews'
            )
            ->where("status_id", 1)
            ->firstOrFail();

select * from `static_options` where `option_name` in ('product_in_stock_text', 'product_out_of_stock_text', 'details_tab_text', 'additional_information_text', 'reviews_text', 'your_reviews_text', 'write_your_feedback_text', 'post_your_feedback_text')
---
        $available_attributes = array_map(fn($i) => array_keys($i), $available_attributes);


        $setting_text = StaticOption::whereIn('option_name', [
            'product_in_stock_text',
            'product_out_of_stock_text',
            'details_tab_text',
            'additional_information_text',
            'reviews_text',
            'your_reviews_text',
            'write_your_feedback_text',
            'post_your_feedback_text',
        ])->get()->mapWithKeys(fn($item) => [$item->option_name => $item->option_value])->toArray();

select * from `campaigns` where `campaigns`.`id` = '14' limit 1
---
    public function campaign($id)
    {
        $campaign = Campaign::findOrFail($id);

select `id`, `name` from `sub_categories` where `slug` = 't-shirt' and `sub_categories`.`deleted_at` is null limit 1
select `product_id` from `product_sub_categories` where `sub_category_id` = 10
select count(*) as aggregate from `products` where `id` in (191, 192, 196, 201) and `products`.`deleted_at` is null
---
    public function category_products($category_type = null, $slug)
    {
        $type = ['category', 'subcategory', 'child-category'];
        abort_if(!in_array($category_type, $type), 404);

        if ($category_type == 'category') {
            $category = Category::where('slug', $slug)->select('id', 'name')->firstOrFail();
            $products_id = ProductCategory::where('category_id', $category->id)->select('product_id')->pluck('product_id');
        } elseif ($category_type == 'subcategory') {
            $category = SubCategory::where('slug', $slug)->select('id', 'name')->firstOrFail();
            $products_id = ProductSubCategory::where('sub_category_id', $category->id)->select('product_id')->pluck('product_id');
        } else {
            $category = ChildCategory::where('slug', $slug)->select('id', 'name')->firstOrFail();
            $products_id = ProductChildCategory::where('child_category_id', $category->id)->select('product_id')->pluck('product_id');
        }

        $products = Product::whereIn('id', $products_id)->paginate(12);