core/plugins/PageBuilder/PageBuilderSetup.php

    public static function get_saved_addons_for_dynamic_page($page_type, $page_id): string
    {
        $output = '';
        $all_widgets = \Cache::remember('page_id-'.$page_id, 60*60*24, function () use ($page_type, $page_id) {
            return PageBuilder::where(['addon_page_type' => $page_type, 'addon_page_id' => $page_id])->orderBy('addon_order', 'asc')->get();
---
select * from `page_builders` where (`addon_page_type` = 'dynamic_page' and `addon_page_id` = 2) order by `addon_order` asc

    public static function render_frontend_pagebuilder_content_for_dynamic_page($page_type, $page_id): string
    {
        $output = '';
        $all_widgets = \Cache::remember('page_id-'.$page_id, 24*60*60, function () use ($page_type, $page_id) {
            return PageBuilder::where(['addon_page_type' => $page_type, 'addon_page_id' => $page_id])->orderBy('addon_order', 'asc')->get();
---
select * from `page_builders` where (`addon_page_type` = 'dynamic_page' and `addon_page_id` = 1) order by `addon_order` asc