core/app/Helpers/funtions.php

select * from `static_options` where `option_name` = 'maintenance_mode' limit 1
---
function get_static_option($option_name, $default = null)
{
    $value = Cache::remember($option_name, 24 * 60 * 60, function () use ($option_name) {
        try {
            return StaticOption::where('option_name', $option_name)->first();

select * from `static_option_centrals` where `option_name` = 'furnito_theme_name' limit 1
---
function get_static_option_central($option_name, $default = null)
{
    $value = Cache::remember($option_name, 60, function () use ($option_name) {
        try {
            return \App\Models\StaticOptionCentral::where('option_name', $option_name)->first();

select * from `media_uploaders` where `media_uploaders`.`id` is null limit 1
---
function get_attachment_image_by_id($id, $size = null, $default = false): array
{
    $image_details = Cache::remember('media_image_' . $id, 60 * 60 * 24, function () use ($id) {
        return \App\Models\MediaUploader::find($id);

insert into `static_options` (`option_name`, `option_value`, `updated_at`, `created_at`) values ('theme_modify_seeder_ran', 1, '2023-02-13 19:54:38', '2023-02-13 19:54:38')
select * from `static_options` where (`option_name` = 'theme_modify_seeder_ran') limit 1
---
function update_static_option($key, $value): bool
{
    $static_option = null;
    if ($static_option === null) {
        try {
            $static_option = StaticOption::query();
        } catch (\Exception $e) {
        }
    }
    try {
        $static_option->updateOrCreate(['option_name' => $key], [
            'option_name' => $key,
            'option_value' => $value
        ]);

insert into `static_option_centrals` (`option_name`, `option_value`, `unique_key`, `updated_at`, `created_at`) values ('furnito_theme_name', 'Furnito', '83a272cc-7cfe-4fc8-a1c1-f97910f9bdb6', '2023-02-13 20:18:27', '2023-02-13 20:18:27')
select * from `static_option_centrals` where (`option_name` = 'furnito_theme_name') limit 1
---
function update_static_option_central($key, $value): bool
{
    $static_option = null;
    if ($static_option === null) {
        try {
            $static_option = \App\Models\StaticOptionCentral::query();
        } catch (\Exception $e) {
        }
    }
    try {
        $static_option->updateOrCreate(['option_name' => $key], [
            'option_name' => $key,
            'option_value' => $value
        ]);

select * from `languages` where `default` = 1 limit 1
---
function get_default_language()
{
    $defaultLang = \App\Models\Language::where('default', 1)->first();

select * from `pages` where `id` is null limit 1
---
function get_page_slug($id, $default = null)
{
    return \App\Models\Page::where('id', $id)->first()->slug ?? $default;

select `id`, `slug`, `title` from `pages` where `id` = 1 limit 1
---
function get_page_info($id, $default = null)
{
    return \App\Models\Page::where('id', $id)->select('id', 'slug', 'title')->first() ?? $default;

select * from `widgets` where (`widget_location` = 'footer') order by `widget_order` asc
---
function render_frontend_sidebar($location, $args = [])
{
    $output = '';
    $all_widgets = \App\Models\Widgets::where(['widget_location' => $location])->orderBy('widget_order', 'ASC')->get();

select * from `languages` where `default` = 1 limit 1
select * from `languages` where `slug` is null limit 1
---
function get_user_lang_direction()
{
    $default = \App\Models\Language::where('default', 1)->first();
    $user_direction = \App\Models\Language::where('slug', session()->get('lang'))->first();

select * from `payment_gateways` where `status` = 1
---
function render_payment_gateway_for_form($cash_on_delivery = false)
{
    $output = '<div class="payment-gateway-wrapper">';
//    if (empty(get_static_option('site_payment_gateway'))) {
//        return;
//    }

    $output .= '<input type="hidden" name="selected_payment_gateway" value="' . get_static_option('site_default_payment_gateway') . '">';
//    $all_gateway = [
//        'paypal', 'manual_payment', 'mollie', 'paytm', 'stripe', 'razorpay', 'flutterwave', 'paystack','midtrans','payfast','cashfree','instamojo','marcadopago'
//    ];
    $all_gateway = \App\Models\PaymentGateway::where('status', 1)->get();