core/database/seeders/ThemeModifySeeder.php

select * from `themes`
update `tenants` set `theme_slug` = 'hexfashion', `tenants`.`updated_at` = '2023-02-13 19:54:32' where `theme_slug` = 'theme-1'
update `tenants` set `theme_slug` = 'furnito', `tenants`.`updated_at` = '2023-02-13 19:54:32' where `theme_slug` = 'theme-2'
update `tenants` set `theme_slug` = 'medicom', `tenants`.`updated_at` = '2023-02-13 19:54:32' where `theme_slug` = 'theme-3'
select * from `static_options`
---
    public function run()
    {
        $themes = \App\Models\Themes::all();
        foreach ($themes as $theme)
        {
            if ($theme->slug == 'theme-1')
            {
                $theme->update([
                    'slug' => 'hexfashion'
                ]);
            }

            if ($theme->slug == 'theme-2')
            {
                $theme->update([
                    'slug' => 'furnito'
                ]);
            }

            if ($theme->slug == 'theme-3')
            {
                $theme->update([
                    'slug' => 'medicom'
                ]);
            }
        }

        Tenant::where('theme_slug', 'theme-1')->update([
            'theme_slug' => 'hexfashion'
        ]);
        Tenant::where('theme_slug', 'theme-2')->update([
            'theme_slug' => 'furnito'
        ]);
        Tenant::where('theme_slug', 'theme-3')->update([
            'theme_slug' => 'medicom'
        ]);

        $static_option = StaticOption::all();