core/database/seeders/ThemeModifySeederTenant.php

    public function run()
    {
        $themes = [
            'theme_one' => 'hexfashion',
            'theme_two' => 'furnito',
            'theme_three' => 'medicom'
        ];


        foreach ($themes as $index => $value)
        {
            $static_option = StaticOption::where('option_name','regexp',$index)->get();
---
select * from `static_options` where `option_name` regexp 'theme_one'